In [1]:
import mysql.connector as connection
db = connection.connect(host="localhost",user="root",passwd="mysql",db="adityaraj",use_pure=True)
cur = db.cursor()
cur.execute("show tables")
cur.fetchall()

[('employee',), ('glass',), ('glass1',), ('worker',)]

Q.1 - Write an SQL query to show the top n (say 10) records of a table.

In [2]:
class top_n_records:
    try:
        @staticmethod
        def show_top_n_rec(tbl_name , n):
            cur.execute(f"select * from {tbl_name} limit {n}")
            for i in cur.fetchall():
                print(i)
    except Exception as e:
        print(e)
t = top_n_records()
t.show_top_n_rec("worker",10)

(1, 'John', 'Stark', 'Comp', 65000.0)
(2, 'Steve', 'Cole', 'Electrical', 55000.0)
(3, 'Bruce', 'Banner', 'Comp', 50000.0)
(4, 'John', 'Wick', 'Civil', 53000.0)
(5, 'Harry', 'Bush', 'Electrical', 85000.0)
(6, 'Ashley', 'Vidic', 'Comp', 78000.0)
(7, 'Paul', 'Walker', 'Civil', 32000.0)
(8, 'Rio', 'Stark', 'Mechanical', 49000.0)
(9, 'Sergio', 'Rogers', 'Comp', 63000.0)
(10, 'Justin', 'Sule', 'Mechanical', 82000.0)

Q.2 - Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [3]:
class nth_highest_sal:
    try:
        @staticmethod
        def show_nth_salary(tbl_name,col_name,nth_value):
            cur.execute(f"select {col_name} from (select {col_name} from {tbl_name} order by {col_name} desc limit {nth_value} ) sal order by {col_name} asc limit 1")
            for i in cur.fetchall():
                print(i[0])
    except Exception as e:
        print(e)
n_sal = nth_highest_sal()
n_sal.show_nth_salary("worker","emp_salary",5)

63000.0